In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [68]:
df = pd.read_csv("UnemployemenrRate.csv")
df.head()

  realtime_start realtime_end        date  value
0     2025-01-10   2025-01-10  1948-01-01    3.4
1     2025-01-10   2025-01-10  1948-02-01    3.8
2     2025-01-10   2025-01-10  1948-03-01    4.0
3     2025-01-10   2025-01-10  1948-04-01    3.9
4     2025-01-10   2025-01-10  1948-05-01    3.5

In [69]:
df.drop(["realtime_start", "realtime_end"], axis=1, inplace=True)
df.head()

         date  value
0  1948-01-01    3.4
1  1948-02-01    3.8
2  1948-03-01    4.0
3  1948-04-01    3.9
4  1948-05-01    3.5

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 924 entries, 0 to 923
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    924 non-null    object
 1   value   924 non-null    float64
dtypes: float64(1), object(1)
memory usage: 14.6+ KB

In [71]:
df['date'] = pd.to_datetime(df['date'])
df.head()

        date  value
0 1948-01-01    3.4
1 1948-02-01    3.8
2 1948-03-01    4.0
3 1948-04-01    3.9
4 1948-05-01    3.5

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 924 entries, 0 to 923
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    924 non-null    datetime64[ns]
 1   value   924 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 14.6 KB

In [73]:
df.isnull().sum()

date     0
value    0
dtype: int64

In [74]:
df.shape

(924, 2)

In [75]:
df.to_csv("Cleaned/UnemployemenrRateCleaned.csv")